samantha_cordingley/week_05/day_02/tallest/app/controllers/mountains_controller.rb

INSERT INTO "mountains" ("name", "range", "image", "country", "feet") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["range", "test2"], ["image", ""], ["country", "test3"], ["feet", 4566]]
---
  def create
    mountain = Mountain.new
    mountain.name = params[:name]
    mountain.range = params[:range]
    mountain.image = params[:image]
    mountain.country = params[:country]
    mountain.feet = params[:feet]
    mountain.save

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "mountains" SET "image" = ? WHERE "mountains"."id" = ?  [["image", "https://farm5.staticflickr.com/4515/38504030026_2020aa17ae_z.jpg"], ["id", 3]]
---
  def update
    mountain = Mountain.find params[:id]
    mountain.update :name => params[:name], :range => params[:range], :image => params[:image], :country => params[:country], :feet => params[:feet]