christopher_nekich/week_10/day_01/tweeteater/app/controllers/pages_controller.rb

SELECT  "tweets".* FROM "tweets" ORDER BY "tweets"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @tweets = Tweet.all