madeleine_milasas/week_05/day_03/glastonbury/app/views/albums/_form.html.erb

SELECT "bands"."name", "bands"."id" FROM "bands" ORDER BY "bands"."name" ASC
---
    <%= f.label :band %>
    <%= f.select :band_id, Band.order(:name).pluck(:name, :id), :include_blank => true %>