madeleine_milasas/week_05/day_03/glastonbury/app/views/albums/show.html.erb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---

<% unless @album.band.blank? %>