elizabeth_lai/week_05/day_03/reading/app/controllers/authors_controller.rb

INSERT INTO "authors" ("first_name", "last_name", "hometown", "dob") VALUES (?, ?, ?, ?)  [["first_name", "ds"], ["last_name", "dd"], ["hometown", ""], ["dob", "2017-05-05"]]
---
  def create
    author = Author.create author_params

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @author = Author.find params[:id]

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "authors" SET "dob" = ? WHERE "authors"."id" = ?  [["dob", "1965-07-30"], ["id", 1]]
---
  def update
    author = Author.find params[:id]
    author.update author_params

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @author = Author.find params[:id]

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 2]]
---
  def destroy
    author = Author.find params[:id]
    author.destroy