sheren_to/week_05/day_03/celebration/app/views/events/_form.html.erb

    <%= f.label :month_id %>
    <%= f.select :month_id, Month.pluck(:name, :id), :include_blank => true %>
---
SELECT "months"."name", "months"."id" FROM "months"