madeleine_milasas/week_05/day_03/glastonbury/app/views/bands/show.html.erb


<% unless @band.albums.blank? %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = ?  [["band_id", 1]]