madeleine_milasas/week_05/day_02/world_mountains/app/controllers/mountains_controller.rb

  def index
    @mountains = Mountain.all.sort_by { |m| [m.name.downcase] }
---
SELECT "mountains".* FROM "mountains"

  def create
    mountain = Mountain.new
    mountain.name = params[:name]
    mountain.image = params[:image]
    mountain.base_height = params[:base_height].to_i
    mountain.sea_height = params[:sea_height].to_i
    mountain.location = params[:location]
    mountain.fact = params[:fact]
    mountain.save
---
INSERT INTO "mountains" ("name", "image", "base_height", "sea_height", "location", "fact") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Big Mountain"], ["image", ""], ["base_height", 9000], ["sea_height", 99000], ["location", "Australia"], ["fact", "It's big"]]

  def show
    @mountain = Mountain.find params[:slug].to_i # just take int at start of slug to search by
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @mountain = Mountain.find params[:slug].to_i # just take int at start of slug to search by
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    mountain = Mountain.find params[:id]
    mountain.update :name => params[:name], :image => params[:image], :base_height => params[:base_height].to_i, :sea_height => params[:sea_height].to_i, :location => params[:location], :fact => params[:fact]
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "mountains" SET "name" = ?, "base_height" = ?, "sea_height" = ?, "location" = ? WHERE "mountains"."id" = ?  [["name", "βαρεῖα"], ["base_height", 1000], ["sea_height", 2000], ["location", "Greece"], ["id", 19]]