john_coote/week_05/day_03/moma/app/views/works/_form.html.erb

  <%= f.label :artist_id %>
  <%= f.select :artist_id, Artist.pluck(:name, :id), :include_blank => true %>
---
SELECT "artists"."name", "artists"."id" FROM "artists"