madeleine_milasas/week_05/day_03/glastonbury/app/controllers/albums_controller.rb

  def create
    album = Album.create album_params
---
INSERT INTO "albums" ("name", "image", "created_at", "updated_at", "tracklist") VALUES (?, ?, ?, ?, ?)  [["name", "Test 4000"], ["image", "http://www.fillmurray.com/500/400"], ["created_at", "2017-11-25 00:25:42.996955"], ["updated_at", "2017-11-25 00:25:42.996955"], ["tracklist", ""]]

  def edit
    @album = Album.find params[:id]
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    album = Album.find params[:id]
    album.update album_params
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "albums" SET "image" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["image", "http://ksassets.timeincuk.net/wp/uploads/sites/55/2010/11/2009TheXXxx600.jpg"], ["updated_at", "2017-11-22 12:39:43.399327"], ["id", 5]]

  def show
    @album = Album.find params[:id]
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    album = Album.find params[:id]
    album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 3]]