madeleine_milasas/week_05/day_03/glastonbury/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "country", "year", "members", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    band = Band.create band_params

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @band = Band.find params[:id]

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "bands" SET "members" = ?, "updated_at" = ? WHERE "bands"."id" = ?  [["members", "Romy Madley Croft, Oliver Sim, Jamie Smith"], ["updated_at", "2017-11-22 12:06:46.747923"], ["id", 4]]
---
  def update
    band = Band.find params[:id]
    band.update band_params

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @band = Band.find params[:id]

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = ?  [["id", 3]]
---
  def destroy
    band = Band.find params[:id]
    band.destroy