justin_gan/week_05/day_03/typeface/app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @category = Category.find params[:id]