justin_gan/week_05/day_03/typeface/app/controllers/fonts_controller.rb

SELECT "fonts".* FROM "fonts"
---
  def index
    @fonts = Font.all

INSERT INTO "fonts" ("name", "classification", "designer", "image", "category_id") VALUES (?, ?, ?, ?, ?)  [["name", "Futura"], ["classification", ""], ["designer", ""], ["image", ""], ["category_id", 1]]
---
  def create
    font = Font.create font_params

SELECT  "fonts".* FROM "fonts" WHERE "fonts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @font = Font.find params[:id]

SELECT  "fonts".* FROM "fonts" WHERE "fonts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "fonts" SET "image" = ? WHERE "fonts"."id" = ?  [["image", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/GillSansEG.svg/396px-GillSansEG.svg.png"], ["id", 1]]
---
  def update
    font = Font.find params[:id]
    font.update font_params

SELECT  "fonts".* FROM "fonts" WHERE "fonts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @font = Font.find params[:id]

SELECT  "fonts".* FROM "fonts" WHERE "fonts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "fonts" WHERE "fonts"."id" = ?  [["id", 3]]
---
  def destroy
    font = Font.find params[:id]
    font.destroy