sheren_to/week_05/day_02/hydrosphere/app/controllers/oceans_controller.rb

  def create
    ocean = Ocean.new
    ocean.name = params[:name]
    ocean.image = params[:image]
    ocean.area = params[:area]
    ocean.depth = params[:depth]
    ocean.save
---
INSERT INTO "oceans" ("name", "image", "area", "depth") VALUES (?, ?, ?, ?)  [["name", "Arctic2"], ["image", "http://www.cbc.ca/kidscbc2/content/the_feed/wts_arctic_antarctic.jpg"], ["area", 1.0], ["depth", 2.0]]

  def show
    @ocean = Ocean.find params[:id]
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @ocean = Ocean.find params[:id]
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def update
    ocean = Ocean.find params[:id]
    ocean.update :name => params[:name], :image => params[:image],
    :area => params[:area], :depth => params[:depth]
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "oceans" SET "area" = ?, "depth" = ? WHERE "oceans"."id" = ?  [["area", 123456789.0], ["depth", 5678.0], ["id", 6]]