cassandra_essex/week_05/day_02/oceans/app/controllers/ocean_controller.rb

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @ocean = Ocean.find params[:id]

INSERT INTO "oceans" ("name", "image") VALUES (?, ?)  [["name", "test"], ["image", ""]]
---
  def create
  	ocean = Ocean.new
  	ocean.name = params[:name]
  	ocean.image = params[:image]
  	ocean.totalarea = params[:totalarea]
  	ocean.maxdepth = params[:maxdepth]
  	ocean.shorelength = params[:shorelength]

  	ocean.save

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @ocean = Ocean.find params[:id]

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "oceans" SET "name" = ?, "image" = ? WHERE "oceans"."id" = ?  [["name", "Atlantic ii"], ["image", ""], ["id", 1]]
---
  def update
    ocean = Ocean.find params[:id]
      ocean.update :name => params[:name], :image => params[:image], :totalarea => params[:totalarea], :maxdepth => params[:maxdepth], :shorelength => params[:shorelength]

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "oceans" WHERE "oceans"."id" = ?  [["id", 5]]
---
  def destroy
    ocean = Ocean.find params[:id]
    ocean.destroy