john_coote/week_05/day_02/countries/app/controllers/countries_controller.rb

INSERT INTO "countries" ("name", "population", "capital", "cups") VALUES (?, ?, ?, ?)  [["name", "Germany"], ["population", 82000000], ["capital", "Berlin"], ["cups", 4]]
---
  def create
    country = Country.new
    country.name = params[:name]
    country.population = params[:population]
    country.capital = params[:capital]
    country.cups = params[:cups]
    country.save

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @country = Country.find params[:id]

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @country = Country.find params[:id]

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "countries" SET "population" = ?, "capital" = ? WHERE "countries"."id" = ?  [["population", 209], ["capital", "Canberra1"], ["id", 1]]
---
  def update
    country = Country.find params[:id]
    country.update :name => params[:name], :population => params[:population], :capital => params[:capital], :cups => params[:cups]

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "countries" WHERE "countries"."id" = ?  [["id", 2]]
---
  def destroy
    country =Country.find params[:id]
    country.destroy

SELECT "countries".* FROM "countries"
---
  def map
    @countries = Country.all