john_coote/week_05/day_03/jdb/app/controllers/cities_controller.rb

INSERT INTO "cities" ("name", "population", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Leeds"], ["population", 77], ["created_at", "2017-11-22 11:57:20.511466"], ["updated_at", "2017-11-22 11:57:20.511466"]]
---
  def create
    city = City.create city_params

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @city = City.find params[:id]

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cities" SET "population" = ?, "updated_at" = ? WHERE "cities"."id" = ?  [["population", 767], ["updated_at", "2017-11-22 12:01:06.851458"], ["id", 5]]
---
  def update
    city = City.find params[:id]
    city.update city_params

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @city = City.find params[:id]

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 4]]
---
  def destroy
    city = City.find params[:id]
    city.destroy