john_coote/week_05/day_03/jdb/app/controllers/countries_controller.rb

  def create
    country = Country.create country_params
---
INSERT INTO "countries" ("name", "population", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Jamaica"], ["population", 87], ["created_at", "2017-11-22 12:01:57.563279"], ["updated_at", "2017-11-22 12:01:57.563279"]]

  def edit
    @country = Country.find params[:id]
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    country = Country.find params[:id]
    country.update country_params
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "countries" SET "population" = ?, "updated_at" = ? WHERE "countries"."id" = ?  [["population", 8788], ["updated_at", "2017-11-22 12:02:02.926015"], ["id", 3]]

  def show
    @country = Country.find params[:id]
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def destroy
    country = Country.find params[:id]
    country.destroy
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "countries" WHERE "countries"."id" = ?  [["id", 3]]