justin_gan/week_05/day_03/typeface/app/views/fonts/_form.html.erb

SELECT "categories"."name", "categories"."id" FROM "categories"
---
    <%= f.label :category_id %>
    <%= f.select :category_id, Category.pluck(:name, :id), :include_blank => true %>