sheren_to/week_05/day_03/celebration/app/controllers/months_controller.rb

  def create
    month = Month.create month_params
---
INSERT INTO "months" ("name", "days", "image") VALUES (?, ?, ?)  [["name", "January"], ["days", "31"], ["image", "https://christinthecity.files.wordpress.com/2016/01/january-img.jpg"]]

  def show
    @month = Month.find params[:id]
---
SELECT  "months".* FROM "months" WHERE "months"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]