john_coote/week_05/day_03/moma/app/controllers/artists_controller.rb

  def create
    artist = Artist.create artist_params
---
INSERT INTO "artists" ("name", "nationality", "period", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "John"], ["nationality", "English"], ["period", "Late"], ["image", ""], ["created_at", "2017-11-22 03:17:58.645908"], ["updated_at", "2017-11-22 03:17:58.645908"]]

  def update
    artist = Artist.find params[:id]
    artist.update artist_params
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "artists" SET "name" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["name", "Joan Miroyyy"], ["updated_at", "2017-11-22 04:02:19.403137"], ["id", 1]]