john_coote/week_05/day_03/moma/app/controllers/works_controller.rb

  def create
    work = Work.create work_params
---
INSERT INTO "works" ("title", "year", "medium", "style", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    work = Work.find params[:id]
    work.update work_params
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "works" SET "year" = ?, "medium" = ?, "updated_at" = ? WHERE "works"."id" = ?  [["year", "1964"], ["medium", "Painting"], ["updated_at", "2017-11-22 04:20:15.192399"], ["id", 3]]

  def destroy
    work = Work.find params[:id]
    work.destroy
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "works" WHERE "works"."id" = ?  [["id", 4]]