ezra_mizrahi/week_05/day_03/films/app/controllers/directors_controller.rb

INSERT INTO "directors" ("name", "nationality", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "takeshi kitano"], ["nationality", "japanese"], ["image", ""], ["created_at", "2017-11-22 22:15:56.071553"], ["updated_at", "2017-11-22 22:15:56.071553"]]
---
  def create
    director = Director.create director_params

SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def edit
    @director = Director.find params[:id]

SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "directors" SET "nationality" = ?, "updated_at" = ? WHERE "directors"."id" = ?  [["nationality", "japanese"], ["updated_at", "2017-11-22 22:24:19.190315"], ["id", 7]]
---
  def update
    director = Director.find params[:id]
    director.update director_params

SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @director = Director.find params[:id]

SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "directors" WHERE "directors"."id" = ?  [["id", 6]]
---
  def destroy
    director = Director.find params[:id]
    director.destroy