ezra_mizrahi/week_05/day_03/films/app/controllers/films_controller.rb

  def create
    film = Film.create film_params
---
INSERT INTO "films" ("title", "year", "image", "created_at", "updated_at", "director_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "some films"], ["year", "1990"], ["image", ""], ["created_at", "2017-11-22 23:04:20.695874"], ["updated_at", "2017-11-22 23:04:20.695874"], ["director_id", 5]]

  def edit
    @film = Film.find params[:id]
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    film = Film.find params[:id]
    film.update film_params
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "films" SET "title" = ?, "updated_at" = ? WHERE "films"."id" = ?  [["title", "some films"], ["updated_at", "2017-11-22 22:36:30.579175"], ["id", 2]]

  def show
    @film = Film.find params[:id]
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    film = Film.find params[:id]
    film.destroy
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "films" WHERE "films"."id" = ?  [["id", 2]]