john_coote/week_05/day_02/solar_system/app/controllers/planets_controller.rb

INSERT INTO "planets" ("name", "image", "orbit", "diameter", "mass", "moons") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Saturn"], ["image", ""], ["orbit", 1.0], ["diameter", 2.0], ["mass", 3.0], ["moons", 4]]
---
  def create
    planet = Planet.new
    planet.name = params[:name]
    planet.image = params[:image]
    planet.orbit = params[:orbit]
    planet.diameter = params[:diameter]
    planet.mass = params[:mass]
    planet.moons = params[:moons]
    planet.save

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "planets" SET "image" = ? WHERE "planets"."id" = ?  [["image", ""], ["id", 4]]
---
  def update
    planet = Planet.find params[:id]
    planet.update :name => params[:name], :image => params[:image], :orbit => params[:orbit]

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 5]]
---
  def destroy
    planet = Planet.find params[:id]
    planet.destroy