john_coote/week_05/day_03/jdb/app/views/countries/show.html.erb


<% @country.cities.each do |city| %>
---
SELECT "cities".* FROM "cities" WHERE "cities"."country_id" = ?  [["country_id", 4]]