john_coote/week_05/day_03/moma/app/views/artists/show.html.erb

SELECT "works".* FROM "works" WHERE "works"."artist_id" = ?  [["artist_id", 1]]
---

<% @artist.works.each do |work| %>