ezra_mizrahi/week_05/day_03/films/app/views/directors/show.html.erb


<% @director.films.each do |work| %>
---
SELECT "films".* FROM "films" WHERE "films"."director_id" = ?  [["director_id", 8]]