justin_gan/week_05/day_02/mountains/app/controllers/crags_controller.rb

SELECT "crags".* FROM "crags"
---
  def home
    @crags = Crag.all

SELECT  "crags".* FROM "crags" WHERE "crags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @crag = Crag.find params[:id]

INSERT INTO "crags" ("name", "image", "location", "parent_range", "mountain_type") VALUES (?, ?, ?, ?, ?)  [["name", "Contrafort de Rumbau"], ["image", "https://caminsdeperamola.files.wordpress.com/2010/09/roc-de-rumbau.jpg"], ["location", "Oliana, Spain"], ["parent_range", ""], ["mountain_type", ""]]
---
  def create
    crag = Crag.new
    crag.name = params[:name]
    crag.image = params[:image]
    crag.location = params[:location]
    crag.parent_range = params[:parent_range]
    crag.elevation = params[:elevation]
    crag.mountain_type = params[:mountain_type].capitalize
    crag.save

SELECT  "crags".* FROM "crags" WHERE "crags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @crag = Crag.find params[:id]

SELECT  "crags".* FROM "crags" WHERE "crags"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "crags" SET "image" = ? WHERE "crags"."id" = ?  [["image", "http://img.thedailybeast.com/image/upload/v1492185946/articles/2015/02/11/the-key-to-climbing-el-capitan-kale/150210-joiner-cladwell-interview-embed_l64hdb.jpg"], ["id", 8]]
---
  def update
    crag = Crag.find params[:id]
    crag.update :name => params[:name],
                :image => params[:image],
                :location => params[:location],
                :parent_range => params[:parent_range],
                :elevation => params[:elevation],
                :mountain_type => params[:mountain_type]

SELECT  "crags".* FROM "crags" WHERE "crags"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "crags" WHERE "crags"."id" = ?  [["id", 4]]
---
  def destroy
    crag = Crag.find params[:id]
    crag.destroy