ezra_mizrahi/week_05/day_03/films/app/views/films/_form.html.erb

SELECT "directors"."name", "directors"."id" FROM "directors" ORDER BY "directors"."name" ASC
---
  <%= f.label :director_id %>
  <%= f.select :director_id, Director.order(:name).pluck(:name, :id), :include_blank => true %>