justin_gan/week_05/day_03/typeface/app/views/categories/show.html.erb


<% @category.fonts.each do |font| %>
---
SELECT "fonts".* FROM "fonts" WHERE "fonts"."category_id" = ?  [["category_id", 1]]