elizabeth_lai/week_05/day_02/high_places/app/controllers/parks_controller.rb

SELECT "parks".* FROM "parks"
---
  def index
    @parks = Park.all

SELECT  "parks".* FROM "parks" WHERE "parks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def profile
    @park = Park.find params[:id]

INSERT INTO "parks" ("name", "state", "nearest_city", "image") VALUES (?, ?, ?, ?)  [["name", "dsf"], ["state", "df"], ["nearest_city", "df"], ["image", ""]]
---
  def create
    park = Park.new
    park.name = params[:name]
    park.state = params[:state]
    park.nearest_city = params[:nearest_city]
    park.size = params[:size]
    park.image = params[:image]
    park.save

SELECT  "parks".* FROM "parks" WHERE "parks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @park = Park.find params[:id]

SELECT  "parks".* FROM "parks" WHERE "parks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "parks" SET "image" = ? WHERE "parks"."id" = ?  [["image", "https://www.amtrakvacations.com/content/uploads/2015/12/grand-canyon-1024x398.jpg"], ["id", 1]]
---
  def update
    park = Park.find params[:id]
    park.update :name => params[:name], :state => params[:state], :nearest_city => params[:nearest_city], :size => params[:size], :image => params[:image]

SELECT  "parks".* FROM "parks" WHERE "parks"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "parks" WHERE "parks"."id" = ?  [["id", 7]]
---
  def destroy
    park = Park.find params[:id]
    park.destroy